Cortez/app/controllers/maps_controller.rb

  def index
    @maps = Map.all
---
SELECT "maps".* FROM "maps"

  def dump
    Rails.application.eager_load! # To load all models app/models/**/*.rb
    @all_records = ActiveRecord::Base.descendants.map &:all
---
SELECT "maps".* FROM "maps"

  def show
    @maps = Map.find(params[:id])
---
SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @map = Map.new(map_params)

    if @map.save
---
INSERT INTO "maps" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["description", "world"], ["created_at", "2016-02-08 19:26:29.218194"], ["updated_at", "2016-02-08 19:26:29.218194"]]

    def set_map
      @map = Map.find(params[:id])
---
SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", 1]]