Cortez/app/controllers/pins_controller.rb

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", 1]]
SELECT "pins".* FROM "pins" WHERE "pins"."map_id" = ?  [["map_id", 1]]
---
  def index
     @map = Map.find(params[:map_id])
     @pins = @map.pins.all