Cortez/app/views/maps/show.html.erb

  <strong> Pins: </strong>
  <% @map.pins.each do |pins| %>
---
SELECT "pins".* FROM "pins" WHERE "pins"."map_id" = ?  [["map_id", 1]]