Cortez/app/views/pins/index.html.erb

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", 1]]
---
    var handler = Gmaps.build('Google');
    handler.buildMap({ internal: {id: 'map'}}, function(){
    var markers = handler.addMarkers(<%=raw @hash.to_json %>);
    if (markers.length > 0){
      handler.bounds.extendWith(markers);
      handler.fitMapToBounds();
    }
    else{
    var marker = handler.addMarker({
      lat: position.coords.latitude,
      lng: position.coords.longitude,
      picture: {
        url: "",
        width:  0,
        height: 0
      },
    });
    handler.map.centerOn(marker);
    handler.getMap().setZoom(12);
    }
});